hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_dbgmcu.h
/*
; stm32N657_dbgmcu.
; =================

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:	Generated using the .svd description	The 2025-01-01
; Modifs:
;
; Project:	uKOS-X
; Goal:		stm32N657_dbgmcu equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma	once

// DBGMCU address definitions
// --------------------------

typedef struct {
	volatile	uint32_t	IDCODE;
	volatile	uint32_t	CR;
	volatile	uint32_t	RESERVED0[2];
	volatile	uint32_t	APB1LFZ1;
	volatile	uint32_t	APB1HFZ1;
	volatile	uint32_t	APB2FZ1;
	volatile	uint32_t	APB4FZ1;
	volatile	uint32_t	APB5FZ1;
	volatile	uint32_t	AHB1FZ1;
	volatile	uint32_t	AHB5FZ1;
	volatile	uint32_t	RESERVED1[52];
	volatile	uint32_t	SR;
	volatile	uint32_t	DBG_AUTH_HOST;
	volatile	uint32_t	DBG_AUTH_DEV;
	volatile	uint32_t	DBG_AUTH_ACK;
} DBGMCU_TypeDef;

#if (defined(__cplusplus))
#define	DBGMCU_NS	reinterpret_cast<DBGMCU_TypeDef *>(0x44001000u)
#define	DBGMCU_S	reinterpret_cast<DBGMCU_TypeDef *>(0x54001000u)

#else
#define	DBGMCU_NS	((DBGMCU_TypeDef *)0x44001000u)
#define	DBGMCU_S	((DBGMCU_TypeDef *)0x54001000u)
#endif

// IDCODE Configuration

#define	DBGMCU_IDCODE_REV_ID						(0xFFFFu<<16)
#define	DBGMCU_IDCODE_REV_ID_0						(0x1u<<16)
#define	DBGMCU_IDCODE_DEV_ID						(0xFFFu<<0)
#define	DBGMCU_IDCODE_DEV_ID_0						(0x1u<<0)

#define	DBGMCU_IDCODE_DEV_ID_B_0X486				(0x486u<<0)

// CR Configuration

#define	DBGMCU_CR_HLT_TSGEN_EN						(0x1u<<31)
#define	DBGMCU_CR_DBTRGOEN							(0x1u<<28)
#define	DBGMCU_CR_TRACECLKEN						(0x1u<<21)
#define	DBGMCU_CR_DBGCLKEN							(0x1u<<20)
#define	DBGMCU_CR_DBG_STANDBY						(0x1u<<2)
#define	DBGMCU_CR_DBG_STOP							(0x1u<<1)
#define	DBGMCU_CR_DBG_SLEEP							(0x1u<<0)

#define	DBGMCU_CR_HLT_TSGEN_EN_B_0X1				(0x1u<<31)
#define	DBGMCU_CR_HLT_TSGEN_EN_B_0X0				(0x0u<<31)
#define	DBGMCU_CR_DBTRGOEN_B_0X0					(0x0u<<28)
#define	DBGMCU_CR_DBTRGOEN_B_0X1					(0x1u<<28)
#define	DBGMCU_CR_TRACECLKEN_B_0X0					(0x0u<<21)
#define	DBGMCU_CR_TRACECLKEN_B_0X1					(0x1u<<21)
#define	DBGMCU_CR_DBGCLKEN_B_0X0					(0x0u<<20)
#define	DBGMCU_CR_DBGCLKEN_B_0X1					(0x1u<<20)
#define	DBGMCU_CR_DBG_STANDBY_B_0X0					(0x0u<<2)
#define	DBGMCU_CR_DBG_STANDBY_B_0X1					(0x1u<<2)
#define	DBGMCU_CR_DBG_STOP_B_0X0					(0x0u<<1)
#define	DBGMCU_CR_DBG_STOP_B_0X1					(0x1u<<1)
#define	DBGMCU_CR_DBG_SLEEP_B_0X0					(0x0u<<0)
#define	DBGMCU_CR_DBG_SLEEP_B_0X1					(0x1u<<0)

// APB1LFZ1 Configuration

#define	DBGMCU_APB1LFZ1_DBG_I3C2_STOP				(0x1u<<25)
#define	DBGMCU_APB1LFZ1_DBG_I3C1_STOP				(0x1u<<24)
#define	DBGMCU_APB1LFZ1_DBG_I2C3_STOP				(0x1u<<23)
#define	DBGMCU_APB1LFZ1_DBG_I2C2_STOP				(0x1u<<22)
#define	DBGMCU_APB1LFZ1_DBG_I2C1_STOP				(0x1u<<21)
#define	DBGMCU_APB1LFZ1_DBG_TIM11_STOP				(0x1u<<13)
#define	DBGMCU_APB1LFZ1_DBG_TIM10_STOP				(0x1u<<12)
#define	DBGMCU_APB1LFZ1_DBG_WWDG1_STOP				(0x1u<<11)
#define	DBGMCU_APB1LFZ1_DBG_LPTIM1_STOP				(0x1u<<9)
#define	DBGMCU_APB1LFZ1_DBG_TIM14_STOP				(0x1u<<8)
#define	DBGMCU_APB1LFZ1_DBG_TIM13_STOP				(0x1u<<7)
#define	DBGMCU_APB1LFZ1_DBG_TIM12_STOP				(0x1u<<6)
#define	DBGMCU_APB1LFZ1_DBG_TIM7_STOP				(0x1u<<5)
#define	DBGMCU_APB1LFZ1_DBG_TIM6_STOP				(0x1u<<4)
#define	DBGMCU_APB1LFZ1_DBG_TIM5_STOP				(0x1u<<3)
#define	DBGMCU_APB1LFZ1_DBG_TIM4_STOP				(0x1u<<2)
#define	DBGMCU_APB1LFZ1_DBG_TIM3_STOP				(0x1u<<1)
#define	DBGMCU_APB1LFZ1_DBG_TIM2_STOP				(0x1u<<0)

#define	DBGMCU_APB1LFZ1_DBG_I3C2_STOP_B_0X0			(0x0u<<25)
#define	DBGMCU_APB1LFZ1_DBG_I3C2_STOP_B_0X1			(0x1u<<25)
#define	DBGMCU_APB1LFZ1_DBG_I3C1_STOP_B_0X0			(0x0u<<24)
#define	DBGMCU_APB1LFZ1_DBG_I3C1_STOP_B_0X1			(0x1u<<24)
#define	DBGMCU_APB1LFZ1_DBG_I2C3_STOP_B_0X0			(0x0u<<23)
#define	DBGMCU_APB1LFZ1_DBG_I2C3_STOP_B_0X1			(0x1u<<23)
#define	DBGMCU_APB1LFZ1_DBG_I2C2_STOP_B_0X0			(0x0u<<22)
#define	DBGMCU_APB1LFZ1_DBG_I2C2_STOP_B_0X1			(0x1u<<22)
#define	DBGMCU_APB1LFZ1_DBG_I2C1_STOP_B_0X0			(0x0u<<21)
#define	DBGMCU_APB1LFZ1_DBG_I2C1_STOP_B_0X1			(0x1u<<21)
#define	DBGMCU_APB1LFZ1_DBG_TIM11_STOP_B_0X0		(0x0u<<13)
#define	DBGMCU_APB1LFZ1_DBG_TIM11_STOP_B_0X1		(0x1u<<13)
#define	DBGMCU_APB1LFZ1_DBG_TIM10_STOP_B_0X0		(0x0u<<12)
#define	DBGMCU_APB1LFZ1_DBG_TIM10_STOP_B_0X1		(0x1u<<12)
#define	DBGMCU_APB1LFZ1_DBG_WWDG1_STOP_B_0X0		(0x0u<<11)
#define	DBGMCU_APB1LFZ1_DBG_WWDG1_STOP_B_0X1		(0x1u<<11)
#define	DBGMCU_APB1LFZ1_DBG_LPTIM1_STOP_B_0X0		(0x0u<<9)
#define	DBGMCU_APB1LFZ1_DBG_LPTIM1_STOP_B_0X1		(0x1u<<9)
#define	DBGMCU_APB1LFZ1_DBG_TIM14_STOP_B_0X0		(0x0u<<8)
#define	DBGMCU_APB1LFZ1_DBG_TIM14_STOP_B_0X1		(0x1u<<8)
#define	DBGMCU_APB1LFZ1_DBG_TIM13_STOP_B_0X0		(0x0u<<7)
#define	DBGMCU_APB1LFZ1_DBG_TIM13_STOP_B_0X1		(0x1u<<7)
#define	DBGMCU_APB1LFZ1_DBG_TIM12_STOP_B_0X0		(0x0u<<6)
#define	DBGMCU_APB1LFZ1_DBG_TIM12_STOP_B_0X1		(0x1u<<6)
#define	DBGMCU_APB1LFZ1_DBG_TIM7_STOP_B_0X0			(0x0u<<5)
#define	DBGMCU_APB1LFZ1_DBG_TIM7_STOP_B_0X1			(0x1u<<5)
#define	DBGMCU_APB1LFZ1_DBG_TIM6_STOP_B_0X0			(0x0u<<4)
#define	DBGMCU_APB1LFZ1_DBG_TIM6_STOP_B_0X1			(0x1u<<4)
#define	DBGMCU_APB1LFZ1_DBG_TIM5_STOP_B_0X0			(0x0u<<3)
#define	DBGMCU_APB1LFZ1_DBG_TIM5_STOP_B_0X1			(0x1u<<3)
#define	DBGMCU_APB1LFZ1_DBG_TIM4_STOP_B_0X0			(0x0u<<2)
#define	DBGMCU_APB1LFZ1_DBG_TIM4_STOP_B_0X1			(0x1u<<2)
#define	DBGMCU_APB1LFZ1_DBG_TIM3_STOP_B_0X0			(0x0u<<1)
#define	DBGMCU_APB1LFZ1_DBG_TIM3_STOP_B_0X1			(0x1u<<1)
#define	DBGMCU_APB1LFZ1_DBG_TIM2_STOP_B_0X0			(0x0u<<0)
#define	DBGMCU_APB1LFZ1_DBG_TIM2_STOP_B_0X1			(0x1u<<0)

// APB1HFZ1 Configuration

#define	DBGMCU_APB1HFZ1_DBG_FDCAN_STOP				(0x1u<<8)

#define	DBGMCU_APB1HFZ1_DBG_FDCAN_STOP_B_0X0		(0x0u<<8)
#define	DBGMCU_APB1HFZ1_DBG_FDCAN_STOP_B_0X1		(0x1u<<8)

// APB2FZ1 Configuration

#define	DBGMCU_APB2FZ1_DBG_TIM9_STOP				(0x1u<<19)
#define	DBGMCU_APB2FZ1_DBG_TIM17_STOP				(0x1u<<18)
#define	DBGMCU_APB2FZ1_DBG_TIM16_STOP				(0x1u<<17)
#define	DBGMCU_APB2FZ1_DBG_TIM15_STOP				(0x1u<<16)
#define	DBGMCU_APB2FZ1_DBG_TIM18_STOP				(0x1u<<15)
#define	DBGMCU_APB2FZ1_DBG_TIM8_STOP				(0x1u<<1)
#define	DBGMCU_APB2FZ1_DBG_TIM1_STOP				(0x1u<<0)

#define	DBGMCU_APB2FZ1_DBG_TIM9_STOP_B_0X0			(0x0u<<19)
#define	DBGMCU_APB2FZ1_DBG_TIM9_STOP_B_0X1			(0x1u<<19)
#define	DBGMCU_APB2FZ1_DBG_TIM17_STOP_B_0X0			(0x0u<<18)
#define	DBGMCU_APB2FZ1_DBG_TIM17_STOP_B_0X1			(0x1u<<18)
#define	DBGMCU_APB2FZ1_DBG_TIM16_STOP_B_0X0			(0x0u<<17)
#define	DBGMCU_APB2FZ1_DBG_TIM16_STOP_B_0X1			(0x1u<<17)
#define	DBGMCU_APB2FZ1_DBG_TIM15_STOP_B_0X0			(0x0u<<16)
#define	DBGMCU_APB2FZ1_DBG_TIM15_STOP_B_0X1			(0x1u<<16)
#define	DBGMCU_APB2FZ1_DBG_TIM18_STOP_B_0X0			(0x0u<<15)
#define	DBGMCU_APB2FZ1_DBG_TIM18_STOP_B_0X1			(0x1u<<15)
#define	DBGMCU_APB2FZ1_DBG_TIM8_STOP_B_0X0			(0x0u<<1)
#define	DBGMCU_APB2FZ1_DBG_TIM8_STOP_B_0X1			(0x1u<<1)
#define	DBGMCU_APB2FZ1_DBG_TIM1_STOP_B_0X0			(0x0u<<0)
#define	DBGMCU_APB2FZ1_DBG_TIM1_STOP_B_0X1			(0x1u<<0)

// APB4FZ1 Configuration

#define	DBGMCU_APB4FZ1_DBG_IWDG_STOP				(0x1u<<18)
#define	DBGMCU_APB4FZ1_DBG_RTC_STOP					(0x1u<<16)
#define	DBGMCU_APB4FZ1_DBG_LPTIM5_STOP				(0x1u<<12)
#define	DBGMCU_APB4FZ1_DBG_LPTIM4_STOP				(0x1u<<11)
#define	DBGMCU_APB4FZ1_DBG_LPTIM3_STOP				(0x1u<<10)
#define	DBGMCU_APB4FZ1_DBG_LPTIM2_STOP				(0x1u<<9)
#define	DBGMCU_APB4FZ1_DBG_I2C4_STOP				(0x1u<<8)

#define	DBGMCU_APB4FZ1_DBG_IWDG_STOP_B_0X0			(0x0u<<18)
#define	DBGMCU_APB4FZ1_DBG_IWDG_STOP_B_0X1			(0x1u<<18)
#define	DBGMCU_APB4FZ1_DBG_RTC_STOP_B_0X0			(0x0u<<16)
#define	DBGMCU_APB4FZ1_DBG_RTC_STOP_B_0X1			(0x1u<<16)
#define	DBGMCU_APB4FZ1_DBG_LPTIM5_STOP_B_0X0		(0x0u<<12)
#define	DBGMCU_APB4FZ1_DBG_LPTIM5_STOP_B_0X1		(0x1u<<12)
#define	DBGMCU_APB4FZ1_DBG_LPTIM4_STOP_B_0X0		(0x0u<<11)
#define	DBGMCU_APB4FZ1_DBG_LPTIM4_STOP_B_0X1		(0x1u<<11)
#define	DBGMCU_APB4FZ1_DBG_LPTIM3_STOP_B_0X0		(0x0u<<10)
#define	DBGMCU_APB4FZ1_DBG_LPTIM3_STOP_B_0X1		(0x1u<<10)
#define	DBGMCU_APB4FZ1_DBG_LPTIM2_STOP_B_0X0		(0x0u<<9)
#define	DBGMCU_APB4FZ1_DBG_LPTIM2_STOP_B_0X1		(0x1u<<9)
#define	DBGMCU_APB4FZ1_DBG_I2C4_STOP_B_0X0			(0x0u<<8)
#define	DBGMCU_APB4FZ1_DBG_I2C4_STOP_B_0X1			(0x1u<<8)

// APB5FZ1 Configuration

#define	DBGMCU_APB5FZ1_DBG_GFXTIM_STOP				(0x1u<<4)

#define	DBGMCU_APB5FZ1_DBG_GFXTIM_STOP_B_0X0		(0x0u<<4)
#define	DBGMCU_APB5FZ1_DBG_GFXTIM_STOP_B_0X1		(0x1u<<4)

// AHB1FZ1 Configuration

#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH15_STOP			(0x1u<<15)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH14_STOP			(0x1u<<14)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH13_STOP			(0x1u<<13)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH12_STOP			(0x1u<<12)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH11_STOP			(0x1u<<11)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH10_STOP			(0x1u<<10)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH9_STOP			(0x1u<<9)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH8_STOP			(0x1u<<8)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH7_STOP			(0x1u<<7)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH6_STOP			(0x1u<<6)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH5_STOP			(0x1u<<5)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH4_STOP			(0x1u<<4)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH3_STOP			(0x1u<<3)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH2_STOP			(0x1u<<2)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH1_STOP			(0x1u<<1)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH0_STOP			(0x1u<<0)

#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH15_STOP_B_0X0	(0x0u<<15)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH15_STOP_B_0X1	(0x1u<<15)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH14_STOP_B_0X0	(0x0u<<14)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH14_STOP_B_0X1	(0x1u<<14)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH13_STOP_B_0X0	(0x0u<<13)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH13_STOP_B_0X1	(0x1u<<13)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH12_STOP_B_0X0	(0x0u<<12)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH12_STOP_B_0X1	(0x1u<<12)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH11_STOP_B_0X0	(0x0u<<11)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH11_STOP_B_0X1	(0x1u<<11)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH10_STOP_B_0X0	(0x0u<<10)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH10_STOP_B_0X1	(0x1u<<10)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH9_STOP_B_0X0	(0x0u<<9)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH9_STOP_B_0X1	(0x1u<<9)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH8_STOP_B_0X0	(0x0u<<8)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH8_STOP_B_0X1	(0x1u<<8)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH7_STOP_B_0X0	(0x0u<<7)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH7_STOP_B_0X1	(0x1u<<7)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH6_STOP_B_0X0	(0x0u<<6)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH6_STOP_B_0X1	(0x1u<<6)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH5_STOP_B_0X0	(0x0u<<5)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH5_STOP_B_0X1	(0x1u<<5)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH4_STOP_B_0X0	(0x0u<<4)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH4_STOP_B_0X1	(0x1u<<4)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH3_STOP_B_0X0	(0x0u<<3)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH3_STOP_B_0X1	(0x1u<<3)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH2_STOP_B_0X0	(0x0u<<2)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH2_STOP_B_0X1	(0x1u<<2)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH1_STOP_B_0X0	(0x0u<<1)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH1_STOP_B_0X1	(0x1u<<1)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH0_STOP_B_0X0	(0x0u<<0)
#define	DBGMCU_AHB1FZ1_DBG_GPDMA1_CH0_STOP_B_0X1	(0x1u<<0)

// AHB5FZ1 Configuration

#define	DBGMCU_AHB5FZ1_NPU_DBG_FREEZE				(0x1u<<16)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH15_STOP			(0x1u<<15)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH14_STOP			(0x1u<<14)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH13_STOP			(0x1u<<13)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH12_STOP			(0x1u<<12)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH11_STOP			(0x1u<<11)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH10_STOP			(0x1u<<10)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH9_STOP			(0x1u<<9)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH8_STOP			(0x1u<<8)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH7_STOP			(0x1u<<7)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH6_STOP			(0x1u<<6)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH5_STOP			(0x1u<<5)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH4_STOP			(0x1u<<4)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH3_STOP			(0x1u<<3)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH2_STOP			(0x1u<<2)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH1_STOP			(0x1u<<1)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH0_STOP			(0x1u<<0)

#define	DBGMCU_AHB5FZ1_NPU_DBG_FREEZE_B_0X0			(0x0u<<16)
#define	DBGMCU_AHB5FZ1_NPU_DBG_FREEZE_B_0X1			(0x1u<<16)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH15_STOP_B_0X0	(0x0u<<15)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH15_STOP_B_0X1	(0x1u<<15)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH14_STOP_B_0X0	(0x0u<<14)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH14_STOP_B_0X1	(0x1u<<14)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH13_STOP_B_0X0	(0x0u<<13)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH13_STOP_B_0X1	(0x1u<<13)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH12_STOP_B_0X0	(0x0u<<12)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH12_STOP_B_0X1	(0x1u<<12)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH11_STOP_B_0X0	(0x0u<<11)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH11_STOP_B_0X1	(0x1u<<11)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH10_STOP_B_0X0	(0x0u<<10)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH10_STOP_B_0X1	(0x1u<<10)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH9_STOP_B_0X0	(0x0u<<9)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH9_STOP_B_0X1	(0x1u<<9)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH8_STOP_B_0X0	(0x0u<<8)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH8_STOP_B_0X1	(0x1u<<8)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH7_STOP_B_0X0	(0x0u<<7)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH7_STOP_B_0X1	(0x1u<<7)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH6_STOP_B_0X0	(0x0u<<6)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH6_STOP_B_0X1	(0x1u<<6)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH5_STOP_B_0X0	(0x0u<<5)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH5_STOP_B_0X1	(0x1u<<5)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH4_STOP_B_0X0	(0x0u<<4)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH4_STOP_B_0X1	(0x1u<<4)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH3_STOP_B_0X0	(0x0u<<3)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH3_STOP_B_0X1	(0x1u<<3)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH2_STOP_B_0X0	(0x0u<<2)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH2_STOP_B_0X1	(0x1u<<2)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH1_STOP_B_0X0	(0x0u<<1)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH1_STOP_B_0X1	(0x1u<<1)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH0_STOP_B_0X0	(0x0u<<0)
#define	DBGMCU_AHB5FZ1_DBG_HPDMA1_CH0_STOP_B_0X1	(0x1u<<0)

// SR Configuration

#define	DBGMCU_SR_AP1_ENABLE						(0x1u<<17)
#define	DBGMCU_SR_AP0_ENABLE						(0x1u<<16)
#define	DBGMCU_SR_AP1_PRESENT						(0x1u<<1)
#define	DBGMCU_SR_AP0_PRESENT						(0x1u<<0)

#define	DBGMCU_SR_AP1_ENABLE_B_0X0					(0x0u<<17)
#define	DBGMCU_SR_AP1_ENABLE_B_0X1					(0x1u<<17)
#define	DBGMCU_SR_AP0_ENABLE_B_0X1					(0x1u<<16)
#define	DBGMCU_SR_AP1_PRESENT_B_0X1					(0x1u<<1)
#define	DBGMCU_SR_AP0_PRESENT_B_0X1					(0x1u<<0)

// DBG_AUTH_HOST Configuration

#define	DBGMCU_DBG_AUTH_HOST_MESSAGE				(0xFFFFFFFFu<<0)
#define	DBGMCU_DBG_AUTH_HOST_MESSAGE_0				(0x1u<<0)

// DBG_AUTH_DEV Configuration

#define	DBGMCU_DBG_AUTH_DEV_MESSAGE					(0xFFFFFFFFu<<0)
#define	DBGMCU_DBG_AUTH_DEV_MESSAGE_0				(0x1u<<0)

// DBG_AUTH_ACK Configuration

#define	DBGMCU_DBG_AUTH_ACK_DEVICE_ACK				(0x1u<<1)
#define	DBGMCU_DBG_AUTH_ACK_HOST_ACK				(0x1u<<0)

#define	DBGMCU_DBG_AUTH_ACK_DEVICE_ACK_B_0X1		(0x1u<<1)
#define	DBGMCU_DBG_AUTH_ACK_DEVICE_ACK_B_0X0		(0x0u<<1)
#define	DBGMCU_DBG_AUTH_ACK_HOST_ACK_B_0X1			(0x1u<<0)
#define	DBGMCU_DBG_AUTH_ACK_HOST_ACK_B_0X0			(0x0u<<0)
